{
  "unit": "P0-U04",
  "title": "Safety Factor Application Order Verification",
  "auditor": "claude-opus-4.6",
  "timestamp": "2026-02-28T01:50:00Z",
  "status": "PASS",

  "principle": "Safety factors must be applied AFTER uncertainty propagation, never before. Applying SF before uncertainty would double-count conservatism or mask real risk.",

  "engines_audited": [
    {
      "engine": "AdvancedCalculations.ts",
      "location": "line 300",
      "pattern": "safety_factor = max_stress_force / cutting_force",
      "order": "CORRECT — SF is a RATIO computed from already-calculated forces, not a pre-multiplier",
      "notes": "SF < 2 triggers warning (line 309)"
    },
    {
      "engine": "ChuckJawForceEngine.ts",
      "location": "line 162",
      "pattern": "safety_factor computed from result of full force calculation",
      "order": "CORRECT — SF is output metric, not input modifier"
    },
    {
      "engine": "ClampingSimEngine.ts",
      "location": "line 118",
      "pattern": "F_required = F_cutting × safety_factor / (µ × n_surfaces)",
      "order": "CORRECT — SF applied to derive required force FROM calculated cutting force. This is proper: first compute F_cutting, then apply SF to get minimum clamping requirement."
    },
    {
      "engine": "CoolantValidationEngine.ts",
      "location": "lines 385-388, 481-485",
      "pattern": "Material factors (1.3x Ti, 1.8x superalloy) applied as multipliers to base requirements",
      "order": "CORRECT — These are material adjustment factors, not safety factors. Applied after base calculation from physics (L/D ratio, operation type)."
    },
    {
      "engine": "validators.ts (S(x))",
      "location": "lines 536-675",
      "pattern": "Component scores computed independently, then weighted sum",
      "order": "N/A — S(x) is a validation score, not a physical calculation. No SF applied."
    },
    {
      "engine": "autoHookWrapper.ts (Lambda)",
      "location": "lines 210-270",
      "pattern": "Lambda is a validation score based on physical plausibility checks",
      "order": "N/A — Lambda validates post-hoc, does not modify calculations"
    }
  ],

  "violations_found": 0,

  "findings": [
    { "severity": "OK", "finding": "All safety factors are computed as OUTPUT RATIOS (force available / force required) — not as input multipliers" },
    { "severity": "OK", "finding": "ClampingSimEngine correctly applies SF to derive required force from calculated cutting force — proper sequence" },
    { "severity": "OK", "finding": "CoolantValidation material factors are engineering adjustments, not safety factors — correctly applied" },
    { "severity": "OK", "finding": "No instances found of SF applied before uncertainty propagation" },
    { "severity": "INFO", "finding": "Uncertainty propagation itself is not explicitly implemented in most engines — values are deterministic. SF serves as the primary conservatism mechanism." }
  ],

  "exit_conditions_met": {
    "all_paths_verified": true,
    "no_pre_uncertainty_SF": true,
    "order_documented_per_engine": true
  }
}
